/*
Что делать, если минимум за диапозоном популяции?
	+•пересмотреть кроссинг
	+•пересмотреть мутации
	+•поставить ограничения
	+•расстояния? Не знаю, где минимум, но расстояния м/у первый и последним... или окрестность первого? (радиус r1-r2 -> 0)
Что делать с быстрой сходимостью?
	-(проще два запуска)•несколько видов
	-•митоз и мейоз
	•глобальный катаклизм (убить половину и создать новых)
Другие проблемы
	•оптимальная популяция
	+•условия окончания поиска
	•"покрытие" всей территории
	•переписать survive!!!
	•ИДЕЯ. строить прямую через двух родителей и двигать вдоль неё => провалилась. популяция вырождается в эту прямую
	
	
	•если переменный знак, то при первом минусе отсекать все положительные значения и искать макс абс.
	
	P.S.
	Кажется я убил всю прелесть генетических алгоритмов.
	Я жестко натаскал их и они кучей кидаются на первый попавшейся минимум.(а не глобальный)
	Очень легко могут попасть в ловушку...
	*/
